app/controllers/password_resets_controller.rb

  def update
    if params[:user][:password].empty?                  # Case (3)
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)          # Case (4)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$ibsJNVj629oZqPQ4yVQnoOMrzbJD/2WGrIeb3UaPSqLrffysMWzvO"], ["updated_at", 2017-03-25 14:56:38 UTC], ["id", 13]]