app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(page: params[:page], per_page: 5)

INSERT INTO "users" ("userid", "name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["userid", "MyString"], ["name", "MyString"], ["email", "MyString"], ["password", "MyString"], ["created_at", 2017-03-10 12:32:11 UTC], ["updated_at", 2017-03-10 12:32:11 UTC]]
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Foo Bar"], ["email", "foo@bar.com"], ["updated_at", 2017-04-01 05:38:24 UTC], ["id", 762146111]]
---
  def update
    #@user = User.find(params[:id])
    if @user.update_attributes(user_params)