app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], :per_page => 5)
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]